In [1]:
import pandas as pd

In [2]:
friend_list = [
    {'name' : 'John', 'age' : 20, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'}
]
df = pd.DataFrame(friend_list)

In [3]:
df

    name  age        job
0   John   20    student
1   Nate   30    teacher
2  Jenny   30  developer

In [4]:
df[1:3]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [5]:
df = df[1:3]

In [6]:
df

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [7]:
friend_list = [
    {'name' : 'John', 'age' : 20, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'}
]
df = pd.DataFrame(friend_list)
df

    name  age        job
0   John   20    student
1   Nate   30    teacher
2  Jenny   30  developer

In [8]:
df.loc[[0, 2]]

    name  age        job
0   John   20    student
2  Jenny   30  developer

In [9]:
df = df.loc[[0, 2]]

In [10]:
df

    name  age        job
0   John   20    student
2  Jenny   30  developer

In [11]:
friend_list = [
    {'name' : 'John', 'age' : 20, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'}
]
df = pd.DataFrame(friend_list)
df

    name  age        job
0   John   20    student
1   Nate   30    teacher
2  Jenny   30  developer

### by column condition

In [12]:
df[df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [13]:
df.query('age>25')

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [14]:
df

    name  age        job
0   John   20    student
1   Nate   30    teacher
2  Jenny   30  developer

In [15]:
df[ (df.age>25) & (df.name == 'Nate') ]

   name  age      job
1  Nate   30  teacher

## Filter Column

### by index

In [16]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [17]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [18]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [20]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
df_filtered = df[['name', 'age']]

In [23]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [24]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [27]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [28]:
df.filter(like='a', axis=1) # 컬럼 name에 'a'가 들어가 있는 것만 필터.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [29]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [30]:
df.filter(regex='b$', axis=1) # 'b'로 끝나는 column만 찾기

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [31]:
df.filter(regex='e$', axis=1) # 'e'로 끝나는 column만 찾기

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25